import { StatusBar } from 'expo-status-bar';
import { StyleSheet, Text, TouchableHighlight, TouchableOpacity, View ,Animated} from 'react-native';
import { useState } from 'react';
import { Button } from 'react-native';
import {gStyle} from '../styles/style';
import { ScrollView } from 'react-native';
async function askSmth(){
  const response= await fetch("http://127.0.0.1:5000/ask",{
    method:"POST",
    headers:{
      "Content-type":"application/json"
    },
    body:JSON.stringify({text:"world"})
});
  const json=await response.json();
  console.log(json.reply);
}
export default function FirstLesson({navigation}) {
    const loadScene=()=>{
        navigation.navigate('SecondLesson');
    }
  var k=0;
  const[selected,Setselected]=useState(null);
  const[list,setList]=useState([{
    name:'Integer:',
    info:'С++ есть множество переменных которые содержат разные типы данных.'+
    'Одним из них является тип данных “Integer”, короткое обозначение “int”.'+
    'Integer переводится с английского как “Целое число” и он может содержать только целочисленный тип данных.'+
    'Хранение других типов данных приведет к ошибке компиляций или не правильной работе программы.',
    additional_info:``,
    code:`#include <iostream>
    using namespace std;
    int main(){
         int n=10;
    }`
    
  },
  {
    name:'Float:',
    info:`В C++ float — это тип данных с плавающей запятой (от англ. floating point), который используется для представления вещественных чисел (с дробной частью).Число с плавающей запятой означает число которое не имеет целое число и является вещественным числом.
    `,
    additional_info:`Основные сферы применения float:
✅ Графика и игры 🎮
✔ Координаты и движение объектов (OpenGL, DirectX)
✔ Физика в играх (ускорение, гравитация, столкновения)
✔ Цвета (значения от 0.0 до 1.0)
✅ Обработка сигналов и звука 🎵
✔ Частоты звуковых волн
✔ Динамическое изменение громкости
✅ Физическое моделирование ⚡
✔ Простые симуляции в реальном времени
✔ Моделирование погоды, аэродинамики
✅ Встроенные системы (микроконтроллеры, Arduino) 🤖
✔ Работа с датчиками (температура, давление)
✔ Управление двигателями
✅ Машинное обучение и нейросети 🧠
✔ Весовые коэффициенты в нейросетях
✔ Быстрое вычисление градиентов (GPU-ускорение)
`,
    code:`#include <iostream>
    using namespace std;
    int main(){
         float n=10.01;
    }` 
  },
  {
    name:'Double:',
    info:`double — это тип данных с плавающей запятой двойной точности (double precision floating point), который используется для представления вещественных чисел с высокой точностью. Отличие double и float в том что:
double – очень точный и с помощью него можно выполнять математические вычисления. Он используется когда точность вычисления важнее памяти. Float и Double в целом похожи в присваиваний значений.
Когда использовать double?
`,
    additional_info:`✅ Научные вычисления (физика, математика, статистика)
✅ Финансовые расчеты (работа с большими числами)
✅ Графика и 3D-рендеринг (чтобы избежать ошибок округления)
💡 Важно! Даже double не всегда даёт абсолютную точность из-за ограничений представления чисел в двоичной системе.
👉 Если нужна еще большая точность, используй long double.`,
    code:`#include <iostream>
    using namespace std;
    int main(){
         double n=10.01;
    }`
    
  },
  {
    name:'String:',
    info:`string — это класс в C++, предназначенный для работы со строками (текстом).
`,
    additional_info:`Основные характеристики string:
✅ Позволяет хранить последовательность символов
✅ Поддерживает разные операции (конкатенация, поиск, замена и т. д.)
✅ Управляет памятью автоматически
✅ Удобнее, чем массив char[], потому что не требует ручного управления
`,
    code:`#include <iostream>
    using namespace std;
    int main(){
         string n=”charkism”;
    }`
  },
  {
    name:'Character:',
    info:`char — это тип данных, предназначенный для хранения одного символа (буквы, цифры, знака).
`,
    additional_info:`Основные характеристики char:
✅ Хранит один символ (например, 'A', '9', '@')
✅ Размер: 1 байт (обычно 8 бит)
✅ Использует кодировку ASCII (например, 'A' — это 65 в ASCII)
✅ Хранит \0 (нулевой символ) в char[] для строк
`,
    code:`#include <iostream>
    using namespace std;
    int main(){
         char n=”A”;
    }`
  },
  {
    name:'Boolean:',
    info:`bool — это тип данных в C++, который может хранить только два значения:
✅ true (истина, 1)
✅ false (ложь, 0)
`,
    additional_info:`Основные характеристики bool:
✔ Размер обычно 1 байт (может зависеть от компилятора)
✔ Используется для логических выражений и условий
✔ При преобразовании:
Любое ненулевое число → true
Только 0 → false
`,
    code:`#include <iostream>
    using namespace std;
    int main(){
         bool n=true;
         bool m=false;
    }`
  }
]
);
const [isHitted,setIsHitted]=useState(false);
const func=(index)=>{
  Setselected(index);
  setIsHitted(true);
}
  return(
    <View style={gStyle.container}>
        <ScrollView contentContainerStyle={{alignItems:'center',paddingBottom:50}}>
        {list.map((item,index)=>(
          <View key={index} style={[gStyle.topicBlock,{marginVertical:10}]}>
            <TouchableOpacity onPress={()=>Setselected(selected===index ? null:index)} style={gStyle.topicHeader}>
            <Text style={gStyle.sigmoid}>{item.name}</Text>
            </TouchableOpacity>
          
        {selected===index &&(
          <View>
          <View style={gStyle.lessonBox}>
          <Text style={gStyle.lessonTitle}>{item.info}</Text>
          </View>
          <View style={gStyle.lessonCodeBlock}>
          <Text style={gStyle.codeBlock}>{item.code}</Text>
          </View>
          {item.additional_info !=='' &&(
          <View style={{width:'100%',alignItems:'center'}}>
          <Text style={gStyle.lessonTitle1}>{item.additional_info}</Text>
          </View>
      )
}
</View>
        )}
        </View>
      ))}
        
        <Button title='Go to the next lesson' onPress={loadScene}/>
        </ScrollView>
    </View>
  );
}
